'use strict'


// const length = 12 ;
// const num = length(48);  //  ошибка типизации  type error 

// типизация -  это класификация информации
// числа строки boolean (undefined) null - это итпы в JS 

// код при запуске  конвертируется в понятную для пу форму - компеляция

// две концепции типизации 
//  1) динамсическая и статическая 
//  а) некоторые языки  проверяют типы и ищут ошибки на стадии исполнения - динамическая типизация (php, ruby, JS)
//  б)  некоторые языки проверяют типы и ищут ошибки на стадии компеляции - статическая типизация (С++, С#, Java, Go)


//  2) слабая и сильная - насколько серьезно язык программирования проверяет типы 
//  n + '' = 'n';  5 + '5'= '55'
//  n * ''= n; //  слабая типизация (JS)
//  String(num);
//  Number(str);










